school-app/app/controllers/teachers_controller.rb

SELECT "teachers".* FROM "teachers" ORDER BY "teachers"."id" ASC
---
  def index
    @teachers = Teacher.order(:id)

INSERT INTO "teachers" ("name", "photo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "7"], ["photo", "bullshit"], ["created_at", "2019-04-19 19:10:46.095338"], ["updated_at", "2019-04-19 19:10:46.095338"]]
---
  def create
    @teacher = Teacher.new(teacher_params)
    if @teacher.save

UPDATE "teachers" SET "name" = $1, "photo" = $2, "updated_at" = $3 WHERE "teachers"."id" = $4  [["name", "name"], ["photo", "photo"], ["updated_at", "2019-04-19 19:29:34.548486"], ["id", 17]]
---
  def update
    if @teacher.update(teacher_params)

DELETE FROM "teachers" WHERE "teachers"."id" = $1  [["id", 17]]
---
  def destroy
    @teacher.destroy